export const movies = [
  {
    id: 1,
    title: "Ван-Пис",
    genre: ["Приключения", "Комедия", "Фэнтези", "Экшен", "Драма", "Магия"],
    rating: 8.73,
    year: 1999,
    description: "Перед своей казнью легендарный пират Капитан Роджер открыл всему миру тайное место, где спрятал награбленные сокровища.Желающих разгадать загадку острова Гранд Лайн оказалось очень много и сотни смельчаков отправились попытать удачу в это проклятое место. Но никто из них даже представить себе не мог столько опасностей и злобных тварей встретит их на этом острове, затерянном в океане. Большинство энтузиастов так остались лежать там, а те, кому посчастливилось выбраться живыми с острова перестали находку клада считать осуществимой задачей. Но алчные и кровожадные пираты не из тех, кто побоится посетить Гранд Лайн. Главным героем этой истории становится семнадцатилетний юноша Монки Д. Луффи, который одержим мечтой стать Королем пиратов, равным по могуществу самому покойному Роджеру. Собрав команду из таких же храбрых моряков, как и он сам, Луффи отправляется в долгое плавание, чтобы раздобыть сокровища Роджера, которые помогут ему выполнить свою давнюю мечту. Но хватит ли юноше отваги и смекалки, чтобы преодолеть все расставленные хитроумным Роджером ловушки по всему Гранд Лайну или же он со своей командой присоединится к уже погибшим здесь искателям сокровищ? ",
    poster: "https://m.media-amazon.com/images/M/MV5BMTNjNGU4NTUtYmVjMy00YjRiLTkxMWUtNzZkMDNiYjZhNmViXkEyXkFqcGc@._V1_.jpg",
    director: "Тосинори Фукудзава",
    duration: "24 мин."
  },
  {
    id: 2,
    title: "Наруто",
    genre: ["Экшен", "Приключения", "Боевые искусства", "Драма", "Фэнтези"],
    rating: 8.01,
    year: 2002,
    description: "Это история, в которой рассказывается про мальчика-ниндзя. Он мечтает стать Хокаге: главой своей деревни. Но Хокаге – это самый мудрый и сильный ниндзя деревни, поэтому парень попытается преодолеть кучу испытаний, победить множество противников, заслужить уважение, подрасти морально и физически.",
    poster: "https://m.media-amazon.com/images/M/MV5BZTNjOWI0ZTAtOGY1OS00ZGU0LWEyOWYtMjhkYjdlYmVjMDk2XkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    director: "Хаято Датэ",
    duration: "23 мин."
  },
  {
    id: 3,
    title: "Блич",
    genre: ["Экшен", "Школа", "Приключения", "Супернатуральное", "Фэнтези"],
    rating: 7.98,
    year: 2004,
    description: "Куросаки Ичиго — не простой пятнадцатилетний парень, потому как, сколько он себя помнил, всегда мог запросто общаться с духами и призраками, невидимыми для обычных людей. В один судьбоносный день ему является сама синигами (богиня смерти) Кучики Рукия, охотящаяся за Пустым (злым духом, пожирающим души людей). Во время битвы с этим чудовищем Ичиго и Рукия получили серьёзные ранения, и богине пришлось передать парню свои силы, чтобы помочь ему одержать победу над монстром, в результате чего Ичиго сам стал синигами! Но сделав это, Рукия теряет всю свою мощь, и теперь ожидает, что новоявленный синигами продолжит её миссию по отлову и уничтожению Пустых. Так начинаются увлекательные приключения Ичиго и Рукии.",
    poster: "https://m.media-amazon.com/images/M/MV5BOWQwOWY5NTUtMjAyZi00YjQzLTkwODgtNmQwZjU1MGIzZDhjXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    director: "Нориюки Абэ",
    duration: "24 мин."
  },
  {
    id: 4,
    title: "Тетрадь смерти",
    genre: ["Психологический", "Триллер", "Сверхъестественное", "Детектив", "Мистика"],
    rating: 8.62,
    year: 2006,
    description: "Уставший от ухудшающегося мира и от немногословиях своих собратьев, синигами Рюук отправляет на Землю Тетрадь Смерти, наблюдая за тем, что же интересное из этого получится. Его план начинает исполняться, когда Тетрадь Смерти поднимает гениальный ученик старшей школы Лайт Ягами, которому так же наскучил окружающий его мир. Изначально Лайт рассматривал рукопись как чью-то неудавшуюся шутку, но вскоре, экспериментальным путем Лайт открывает правду, написанную в Тетради Смерти. Нужно всего лишь создать изображение человека у себя в уме в тот момент, когда он пишет его имя в Тетради Смерти, и тогда, этот человек умрет через 40 секунд от сердечного приступа. Вооружившись такой невиданной силой, Лайт становится неуловимым убийцей, и он решает сделать этот мир лучше, истребляя криминальных авторитетов и преступников с помощью Тетради Смерти. Вскоре, в интернете и СМИ появляются новости о таинственном 'Кира', который пытается играть в бога. За расследование серии странных убийств, берется загадочный детектив L, который сделает все чтобы остановить Киру. Лайт старается сделать все, что от него зависит, ради того чтобы люди не раскрыли его личность, даже если это будет означать убийство невинных, которые могут помочь расследованию.",
    poster: "https://m.media-amazon.com/images/M/MV5BYTgyZDhmMTEtZDFhNi00MTc4LTg3NjUtYWJlNGE5Mzk2NzMxXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    director: "Тэцуро Араки",
    duration: "23 мин."
  },
  {
    id: 5,
    title: "Атака Титанов",
    genre: ["Экшен", "Драма", "Фэнтези", "Триллер", "Военное", "Выживание"],
    rating: 8.56,
    year: 2013,
    description: "Закат человеческой эры пришёл с возникновением особой расы Титанов. Люди за столетие так и не нашли способов их полного уничтожения, как и не смогли узнать о происхождении этих колоссов. Остатки человеческой цивилизации создали государство, надежно защищенное тремя стенами, построенными по системе круговых колец, с именами: «Мария», «Роза», «Шина». Стены надежно укрывают и обеспечивают тихую жизнь потомкам тех, кто их строил. Но есть и обратная сторона: стены помимо защитной функции не дают возможности покинуть эти земли. Мечта увидеть внешний МИР не оставляет главного героя Эрена… Спокойная жизнь не вечна, как и детство, и в один из солнечных дней 845 года Титан невероятных размеров и мощи пробивает брешь в крепостной стене Шиганшины, родного города Эрена.Этот день станет последним для тысяч людей не только этого города, так как вслед за ним под натиском Титанов падёт и внешняя стена «Мария».Друзьям Эрену, Микасе и Армину удается уцелеть.Человечество оказывается под угрозой полного уничтожения.Треть всей земли потеряна, количество жертв достигает невероятных размеров.Эрен собирается вступить в «Легион разведки», чтобы уничтожать Титанов.Месть – тоже стимул для того, чтобы жить, ведь «этот мир жесток и беспощаден»",
    poster: "https://lh3.googleusercontent.com/proxy/65j3aGcL77EXs4j4IgVs2ztWjKzO9oPdx7iY5yb1HeW-8t4fedKQumWcqOleRygV8Xy-fdAf4q95w3RGtH3hjhZxP66taiyo",
    director: "Тэцуро Араки",
    duration: "24 мин."
  },
  {
    id: 6,
    title: "ДжоДжо",
    genre: ["Исторический", "Приключения", "Сверхъестественное", "Фэнтези"],
    rating: 7.87,
    year: 2012,
    description: "Великобритания, XIX век. Джонатан Джостар, он же ДжоДжо, счастливо живёт в особняке со своим отцом. И вот у его семьи случается пополнение — отец семейства Джордж Джостар усыновляет странного паренька по имени Дио Брандо. Джонатан рад — у него появится новый друг. Однако Дио вовсе не настроен проявлять дружелюбие. Он задумал избавиться от единственного наследника Джостаров и заполучить всё их состояние себе. Мало того, что он избил Джостара-младшего в спарринге по боксу, настроил его друзей против Джонатана, так ещё и украл первый поцелуй у его девушки! Как будто этого мало, Дио сжигает в печи любимую собаку Джонатана — Денни. Но хуже всего то, что Дио тоже лыком не шит — на людях он ведёт себя как образцовый джентльмен. Тут терпению ДжоДжо приходит конец...",
    poster: "https://preview.redd.it/what-do-you-think-of-part-1-of-jojo-v0-gvecdthbcp4e1.jpeg?auto=webp&s=889d9918e9e41f6eb95c19799462c7df8862713a",
    director: "Кэнъити Судзуки",
    duration: "24 мин."
  },
  {
    id: 7,
    title: "Ковбой Бибоп",
    genre: ["Вестерн", "Сай-Фай", "Фантастика", "Приключения"],
    rating: 8.75,
    year: 1998,
    description: "2071 год. Человечество колонизировало всю Солнечную Систему, основав колонии от Венеры до Юпитера. Но десятилетия тому назад из-за техногенной катастрофы была уничтожена Луна. Последствия оказались катастрофическими: непрерывные метеоритные дожди сделали жизнь на поверхности Земли невозможной, а в первые недели после катастрофы погибло 4,7 миллиарда человек. Большая часть выживших перебралась в колонии на другие планеты. Со временем по всей Солнечной Системе разрослись и набрали силу преступные синдикаты, для борьбы с которыми правительство возродило древнюю практику охоты за головами. Отныне охотники за головами разъезжают по всей Солнечной Системе в поисках целей. Спайк Шпигель и Джет Блэк – охотники. Волею судьбы они оказались на космическом корабле «Bebop 268710». Путешествуя вместе, они подбирают Фэй Валентайн – очаровательную картёжницу с невероятно огромным долгом, Радикал Эдварда – компьютерного гения и генетически модифицированную собаку Эйн. На борту «Bebop» судьба сводит четырёх человек и одну собаку, и так начинаются их совместные приключения...",
    poster: "https://m.media-amazon.com/images/M/MV5BMTU3ZTdiOGQtYmYwYy00OGM5LThmNjMtZGJmNTVlZjk1ZmEyXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    director: "Синъитиро Ватанабэ",
    duration: "24 мин."
  },
  {
    id: 8,
    title: "Код Гиас",
    genre: ["Меха", "Политика", "Триллер", "Фэнтези"],
    rating: 8.71,
    year: 2006,
    description: "Будущее. Япония была захвачена Британской Империей. Её переименовали в 'Зону 11', а ее жителей называют 'одиннадцатыми'. Британская империя отнимает автономию у Японии и продолжает навязывать свою силу с помощью 'Найтмер Фрейм'. Правила Империи никогда не дрогнут, но по ним уже начинают идти трещины... Британский студент, Лелуш, после неожиданной встречи с таинственной девушкой С.С, во время столкновения военных и повстанцев, получает магическую силу - Гиасс, абсолютную власть, которая может подчинить любого человека , который будет выполнять любые приказы. Лелуш составляет план уничтожения Британской империи, используя в качестве оружия Гиасс. Он втирается в доверие к повстанцам, под маской защитника справедливости Зеро. И начинает осуществлять свои цели. Отомстить за мать и создать мир, где его сестра Нанналли, сможет жить в мире. Даже не смотря на то, что его противником будет самый ужасный человек в мире - его отец Император Британии.",
    poster: "https://m.media-amazon.com/images/M/MV5BNTk4MWYwNmUtODFjNC00NWJhLWExNGYtMGU4YmRlNzEwOTY1XkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    director: "Горо Танигути",
    duration: "24 мин."
  },
  {
    id: 9,
    title: "Стальной алхимик: Братство",
    genre: ["Магия", "Приключения", "Комедия", "Драма"],
    rating: 9.10,
    year: 2009,
    description: "Они дерзко нарушили самый главный закон в алхимии и очень сильно за это поплатились. Теперь двум братьям героям нужно найти загадочный и мистический философский камень. Вместе ребята отправляются на его поиски по всему миру, ведь только этот камень способен исправить то, что они сотворили... А ведь это не обычный мир, вместо науки тут властвует магия, и люди, обладающие способностью подчинять себе стихии. Магия тоже имеет свои ограничения, которым необходимо неукоснительно следовать. Тех, кто ослушается, ждет очень жестокая и страшная расправа. Братья Альфонс и Эдвард хотят совершить совершенно невообразимое и крайне запретное: воскресить из мертвых свою мать. Однако закон всемирного баланса не обмануть, если тебе нужно получить что-то, ты непременно должен пожертвовать чем-то равноценным.",
    poster: "https://m.media-amazon.com/images/M/MV5BMzNiODA5NjYtYWExZS00OTc4LTg3N2ItYWYwYTUyYmM5MWViXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    director: "Ясухиро Ириэ",
    duration: "24 мин."
  },
  {
    id: 10,
    title: "Сага о Винланде",
    genre: ["Приключения", "История", "Драма", "Экшен"],
    rating: 8.77,
    year: 2019,
    description: "На протяжении тысячи лет викинги буйствовали в северных водах, заслужив себе звание жестокой и воинственной расы. Торфинн — сын одного из величайших воинов среди викингов. После героической смерти своего отца юноша постоянно совершенствовал свои навыки дабы свершить свою месть. Став на путь воина, он жаждет честного поединка с убийцей своего отца, потому вступает в отряд своего врага и выполняет для него самые сложные задания, получая в награду право на дуэль. Но он ещё не знает, что ждёт на его дальнейшем пути....",
    poster: "https://m.media-amazon.com/images/M/MV5BNDA3MGNmZTEtMzFiMy00ZmViLThhNmQtMjQ4ZDc5MDEyN2U1XkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    director: "Сюхэй Ябута",
    duration: "24 мин."
  },
  {
    id: 11,
    title: "Хантер Хантер",
    genre: ["Приключения", "Комедия", "Фэнтези", "Экшен", "Магия"],
    rating: 9.03,
    year: 2011,
    description: "Охотник — это тот, кто путешествует по миру, выполняя различные опасные миссии: от поимки преступников до поисков сокровищ в неизведанных землях. Главный герой — мальчик по имени Гон. Его отец, Джин, был охотником, но исчез много лет назад. Гон считает, что если пойдёт по стопам отца и станет охотником, то рано или поздно вновь встретится с ним. Мальчик надеется, что, повстречав отца, наконец сможет задать ему один-единственный вопрос: почему он предпочёл жизнь охотника своему маленькому сынишке. Гон, как в своё время и его отец, покидает родной остров с целью сдать официальный экзамен на охотника. Но экзамен очень сложен, и каждый год множество людей погибают, пытаясь получить это звание. Во время своего путешествия Гон знакомится с Курапикой, Леорио и Киллуа, вместе с которыми ступает на тернистый путь охотника.",
    poster: "https://m.media-amazon.com/images/M/MV5BYzYxOTlkYzctNGY2MC00MjNjLWIxOWMtY2QwYjcxZWIwMmEwXkEyXkFqcGc@._V1_.jpg",
    director: "Хироси Кодзина",
    duration: "23 мин."
  },
  {
    id: 12,
    title: "Гинтама",
    genre: ["Комедия", "Экшен", "Приключения", "Фантастика", "Исторический"],
    rating: 9.02,
    year: 2006,
    description: "Сюжет данного аниме пойдет про молодого самурая, по имени, Гинтоки Саката. Его верные спутники, команда, которая состоит из его ученика Шимпачи, наследницы самого сильного клана в Японии – Кагура, и ее личного и огромного пса Садахару. Повествование пойдет со времен, когда инопланетяне, которые называют себя Аманто, захватили нашу планету, правительство просто сдается, ведь оно не может воевать с высокими технологиями. По всей стране запрещают использование мечей, и самураи становятся просто ненужными. Однако некоторые просто не способны все это забыть, и начинают сопротивляться, ведь в них течет настоящая самурайская кровь. Именно таким и является наш главный герой. Он вместе со своей командой берется за любую работу, чтобы заработать себе деньги на жизнь и заплатить наконец-то за их проживание. Данное аниме не наполнено какими-то многочисленными боями, а просто представляет собой юмористическое похождение Гинтоки. Зритель сможет от души посмеется над образами героев, манерой их поведения, а также обычными шутками, которых действительно много в данной картине.",
    poster: "https://m.media-amazon.com/images/M/MV5BNTMzNjE0N2ItNjFiYi00NmIzLTk1MzMtZWFjNThjMzI5MTJlXkEyXkFqcGc@._V1_.jpg",
    director: "Синдзи Такамацу",
    duration: "24 мин."
  },
  {
    id: 14,
    title: "Монстр",
    genre: ["Триллер", "Драма", "Психологический", "Детектив", "Мистика"],
    rating: 8.89,
    year: 2004,
    description: "Доктор Кэндзо Тэнма — талантливый хирург, который работает в Германии. Однажды он спасает тяжело раненого мальчика. Этот случай послужит началом череды загадочных убийств, а спустя годы Кэндзо вновь столкнётся с тем, кого он когда-то спас от смерти.",
    poster: "https://m.media-amazon.com/images/M/MV5BYzU2MWQ5NGQtYmNlMC00ZjJkLWJmODItZDM5MDM3YmUyMWJkXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    director: "Масаюки Кодзима",
    duration: "24 мин."
  }
];
